# TrussShiftedReferences Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TrussShiftedReferences Property
BuiltInFailures..::..SketchFailures Class See Also
---
Truss top and bottom references (chains of one or more reference lines) must overlap at least partially in the vertical direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussShiftedReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussShiftedReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussShiftedReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace